Revit 2024 API
Sweep.IsTrajectorySegmentationEnabled Property
The trajectory segmentation option for the sweep.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsTrajectorySegmentationEnabled { get; set; }
Visual Basic
Public Property IsTrajectorySegmentationEnabled As Boolean
	Get
	Set
Visual C++
public:
property bool IsTrajectorySegmentationEnabled {
	bool get ();
	void set (bool value);
}
Remarks
This property is used to retrieve/set the trajectory segmentation state of the sweep. if return is true, means user can control the MaxSegmentAngle, otherwise is disable.
See Also
Sweep Class
Autodesk.Revit.DB Namespace